cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/cask'

brew 'ack'
brew 'coreutils'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'cocoapods'
brew 'carthage'
brew 'git-extras'

cask 'iterm2'
# cask 'ringcentral'
cask 'fastlane'
cask 'atom'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'tunnelbear'
cask 'vlc'
cask 'flux'
